Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་རྨད་དུ་བྱུང་བ་སྐྱེ་བའི་ཡུལ་ནི་མཆོད་གནས་སྤྱོད་ཅེས་བྱའོ། །
en: “The thus-gone Caitraka will be born in a place called Engaging with the Objects of Worship.

source: ཡབ་ནི་གྲགས་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Fame will be his father.

source: ཡུམ་ནི་ཉི་མའི་སྙིང་པོ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Essence of the Sun will be his mother.

source: སྲས་ནི་ཡིད་འོང་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Delightful Renown will be his son.

source: རིམ་གྲོ་པ་ནི་ཕན་ལྡན་བློ་ཞེས་བྱའོ། །
en: Beneficial Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཁས་པ་ལྷ་རྫས་རྫོགས་པ་ཞེས་བྱའོ། །
en: Scholar of Perfect Divine Substance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲེགས་འགྲོ་ཞེས་བྱའོ། །
en: Dominant Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཅུའོ། །
en: There will be ninety consecutive congregations, each of them gathering one hundred billion.

source: དེ་བཞིན་གཤེགས་པ་ང་རྒྱལ་སྤོང་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་རྫོགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mānajaha will be born in a place called Perfect Splendor.

source: ཡུམ་ནི་བློ་གྲོས་བསོད་ནམས་ཏོག་ཅེས་བྱའོ། །
en: Crest of Meritorious Intelligence will be his mother.

source: སྲས་ནི་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Infinite Light will be his son.

source: རིམ་གྲོ་པ་ནི་མཚན་གྱི་གཟི་བརྗིད་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Splendid Marks will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Lion Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རབ་མཆོག་གསལ་བ་ཞེས་བྱའོ། །
en: Clear Supremacy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be sixty consecutive congregations, each of them gathering one million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་བདུད་བརླག་པར་མཛད་པ་སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mārakṣayaṃkara will be born in a place called Array of Awakening.

source: ཡབ་ནི་རིན་ཆེན་གཟི་བརྗིད་ཀུན་ཏུ་སྦེད་ཅེས་བྱའོ། །
en: Concealed Jewel Splendor will be his father.

source: ཡུམ་ནི་བཀོད་པ་དཔག་ཏུ་མེད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Fathomless Array will be his mother.

source: སྲས་ནི་རྣམ་པར་བརྩེ་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Reveling Roar will be his son.

source: རིམ་གྲོ་པ་ནི་བྱམས་པ་མཐའ་ཡས་བློ་ཞེས་བྱའོ། །
en: Mind of Infinite Love will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་དབྱངས་ཞེས་བྱའོ། །
en: Melodious Thunder will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Thundering Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be ninety-six consecutive congregations, each of them gathering six million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་བག་ཆགས་ལས་རྒལ་བའི་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མཚུངས་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vāsanottīrṇa­gati will be born in a place called Unparalleled Array.

source: འོད་ནི་དཔག་ཚད་བྱེ་བ་ཕྲག་འབུམ་མོ། །
en: His light will extend one trillion leagues.

source: ཡབ་ནི་འཇིག་རྟེན་སྙན་པར་གྲགས་ཞེས་བྱའོ། །
en: Famed in the World will be his father.

source: སྲས་ནི་དགའ་དང་གྲགས་ཞེས་བྱའོ། །
en: Joy and Fame will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་པའི་བློ་གྲོས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Famed Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིའི་ཟླ་བའི་འོད་ཅེས་བྱའོ། །
en: Light of the Moon of Humanity will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱེ་དབང་མཚུངས་ཞེས་བྱའོ། །
en: Equal of the Master of Humanity will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be ninety consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་མི་ཕྱེད་པའི་བློ་མངའ་བ་སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་ངེས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Abhedyabuddhi will be born in a place called Certain Awakening.

source: འོད་ནི་དཔག་ཚད་སུམ་སྟོང་སུམ་བརྒྱའོ། །
en: His light will extend three thousand three hundred leagues.

source: ཡབ་ནི་གཟི་བརྗིད་འབྱོར་ཅེས་བྱའོ། །
en: Splendid Wealth will be his father.

source: ཡུམ་ནི་གྲགས་ཆེན་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Great Renown will be his mother.

source: སྲས་ནི་རྒྱལ་མཚན་གྱི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Banner will be his son.

source: རིམ་གྲོ་པ་ནི་ཡན་ལག་མ་སྨད་པ་ཞེས་བྱའོ། །
en: Impeccable Limbs will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Jewel of Nectar will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་གྲགས་པ་སེམས་ཞེས་བྱའོ། །
en: Mind of Famed Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་ལྔ་ལྔའོ། །
en: There will be forty consecutive congregations, each of them gathering five hundred million.

source: དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Udadhi will be born in a place called Clear Joy.

source: ཡབ་ནི་རྒྱུ་སྐར་ཏོག་ཅེས་བྱའོ། །
en: Star Crest will be his father.

source: ཡུམ་ནི་བདེ་སྟོབས་གྲགས་ཞེས་བྱའོ། །
en: Famed Strength of Bliss will be his mother.

source: སྲས་ནི་བག་ཡོད་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Carefulness will be his son.

source: རིམ་གྲོ་པ་ནི་མཁས་བརྩོན་ཞེས་བྱའོ། །
en: Learned Diligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་བདེན་པ་ཞེས་བྱའོ། །
en: True Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Master of Fragrances will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be ninety consecutive congregations, each of them gathering nine hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་དག་པར་མཛད་པ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Śodhita will be born in a place called Adorned with Splendor.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཁྲི་བདུན་སྟོང་ངོ་། །
en: His light will extend sixty-seven thousand leagues.

source: ཡབ་ནི་རིན་ཆེན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Jewel Flower will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Precious Qualities will be his mother.

source: སྲས་ནི་སེང་གེའི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Lion Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་གཡོ་བ་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Remaining Immutable will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་སྙིང་པོ་དཔལ་ཞེས་བྱའོ། །
en: Glorious Essence of the Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མངོན་པར་ཤེས་པས་རྣམ་པར་བརྩེ་བ་ཞེས་བྱའོ། །
en: Reveling with Superknowledge will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བཞི་བཞིའོ། །
en: There will be seventy consecutive congregations, each of them gathering four hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་གྲོལ་བའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Gaṇimuktirāja will be born in a place called Best of Jewels.

source: འོད་ནི་དཔག་ཚད་ལྔ་ཁྲིའོ། །
en: His light will extend fifty thousand leagues.

source: ཡུམ་ནི་ཀུན་ཏུ་རིན་ཆེན་ཞེས་བྱའོ། །
en: Universal Jewel will be his mother.

source: སྲས་ནི་མེ་ཏོག་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Flower Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ཚྭ་རྒོ་བྱིན་ཞེས་བྱའོ། །
en: Salty Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྲིད་པའི་སྲེད་པ་འཇོམས་པ་ཞེས་བྱའོ། །
en: Conqueror of the Craving of Existence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཛིན་པ་དཔག་མེད་ཅེས་བྱའོ། །
en: Fathomless Grasp will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་སྤྱད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Priyābha will be born in a place called Partaking of Awakening.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: His light will extend thirty-eight thousand leagues.

source: ཡབ་ནི་ཡིད་འོང་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Delightful Splendor will be his father.

source: ཡུམ་ནི་ང་རོ་སྙན་པའི་སེང་གེའི་སྒྲ་ཞེས་བྱའོ། །
en: Gorgeously Roaring Lion Voice will be his mother.

source: སྲས་ནི་བཞིན་གཙང་ཞེས་བྱའོ། །
en: Pure Countenance will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་གྲགས་ཞེས་བྱའོ། །
en: Famed Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་སྐྱེད་མོས་ཚལ་ཞེས་བྱའོ། །
en: Nectar Garden will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་སེམས་ཞེས་བྱའོ། །
en: Concern for the World will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུའོ། །
en: There will be ninety-four consecutive congregations, each of them gathering nine million nine hundred thousand.

source: བདེ་གཤེགས་བྱང་ཆུབ་རྒྱལ་མཚན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཆོས་དག་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The well-gone Bodhidhvaja Will be born in a place called Illuminating the Dharma.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ལེགས་བཟང་ཡིན། །ཆུ་ལྷ་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend seventy leagues. “Exquisite Excellence will be his father, and Water God Worship will be this victor’s mother.

source: སྲས་པོ་རྩི་སྨན་དཔའ་བོ་རིམ་གྲོ་པ། །
en: Medicine will be his son and Hero his attendant.

source: ཕྱོགས་མཆོད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Universal Worship will be the scholar

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །ཁམས་གསུམ་སྲིད་ལ་ངར་ནི་མི་འཛིན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred ninety million Who do not apprehend an ‘I’ within the three realms of existence.

source: ཁྱུ་མཆོག་ཆེན་པོའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this supreme leader Will remain for seventy-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་དྲུག་པ་གཅིག་གསེར་གྱིས་མཛེས་པར་བྱས། །
en: The stūpa with the relics of this victor Will be sixteen leagues large and adorned with gold.

source: མི་ཡི་འདྲེན་པ་ཡེ་ཤེས་རིན་ཆེན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཐམས་ཅད་བརྒྱན་ཅེས་བྱ། །
en: “The guide of humanity, Jñānaratna, Will be born in a place called Universal Adornment.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་ལེགས་མཆོག་ཡིན། །འཇིག་རྟེན་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend five hundred leagues. “Supreme Excellence will be his father, and Supreme in the World will be this victor’s mother.

source: སྲས་པོ་གྲོལ་འདོད་ཟླ་བ་རིམ་གྲོ་པ། །
en: Wish for Liberation will be his son and Moon his attendant.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ང་མེད་ཚུལ་འཆོས་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering two hundred forty million worthy ones For whom there is no ‘I’ and who are free from hypocrisy.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has gone to cessation his sacred Dharma Will remain for seventy-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུར་འབྱུང་། །
en: The relics of this victor will be abundant, Residing in eight hundred billion stūpas.

source: མི་ཡི་འདྲེན་པ་ཤིན་ཏུ་བསིལ་བ་ཡི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་རྣམ་པར་གྲགས་ཞེས་བྱ། །
en: “The guide of humanity, Suśītala, Will be born in a place called Famed Wisdom.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཚངས་བཟང་ཡིན། །ཡེ་ཤེས་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend thirty-two leagues. “Excellent Brahmā will be his father, and Light of Wisdom will be this victor’s mother.

source: སྲས་པོ་ལྷ་ཡིན་བློ་གྲོས་རིམ་གྲོ་པ། །
en: Divinity will be his son and Intelligence his attendant.

source: བློ་ལྡན་སྙོམས་པ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Even Possession of Wisdom will be the one of intelligence

source: འཇིག་པ་མེད་པར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering nine hundred ninety million Worthy ones who have gone beyond.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་རྒྱལ་མཚན་མཆོག་གིས་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa Five leagues large and adorned with banners.

source: འཇིག་རྟེན་མགོན་པོ་ཚངས་པ་རྒྱལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལེགས་པར་སྦྱངས་ཞེས་བྱ། །
en: “The protector of the world, Brahmarāja, Will be born in a place called Well Purified.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དྲན་ལྡན་ཡིན། །དགེ་བའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Endowed with Mindfulness will be his father, and Light of Virtue will be this victor’s mother.

source: སྲས་པོ་ལྟ་བྱེད་གྲགས་པ་རིམ་གྲོ་པ། །
en: Eye will be his son and Fame his attendant.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །འཇིག་རྟེན་དྲི་མ་དྲི་བྲལ་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-two consecutive congregations, Each of them gathering three hundred twenty million Worthy ones who are free from the stains of the world.

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And for the benefit of wandering beings The sacred Dharma will remain for ninety-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱ་པ་གསེར་གྱི་རྣ་རྒྱན་ཅན། །
en: The relics of this victor will reside in a single stūpa One hundred leagues large and adorned with gold.

source: སངས་རྒྱས་ཡེ་ཤེས་དགྱེས་པ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཡོན་ཏན་ཀུན་གྱི་འོད་ཅེས་བྱ། །
en: “The buddha Jñānarata Will be born in a place called Light of All Qualities.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་བརྒྱ་བརྟུལ་ཞུགས་དབང་པོ་ཡབ། །དབང་པོའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend eight hundred leagues. “Master of Yogic Discipline will be his father, and Masterful Light will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་སྣང་བྱེད་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Illuminator his attendant.

source: ཀུན་ཏུ་གཙོ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Universal Leader the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །ལམ་རབ་མཆོག་མར་ཤིན་ཏུ་དུལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-two congregations, Each of them gathering nine hundred thirty million Who are perfectly trained upon the supreme path.

source: ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: His sacred Dharma will remain for seventy-six thousand years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུ་འབྱུང་། །
en: Residing in eight hundred billion stūpas.

source: རྒྱལ་བ་རྫུ་འཕྲུལ་ཏོག་གི་སྐྱེ་བའི་ཡུལ། །བསོད་ནམས་རྣམ་པར་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The victor Ṛddhiketu Will be born in a place called Illuminating Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་བཅུ་འབྱོར་པའི་དབང་པོ་ཡབ། །བསོད་ནམས་གྲགས་པ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །བསོད་ནམས་ལེགས་ངེས་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend eight hundred leagues. “Master of Wealth will be his father, and Famed Merit will be this victor’s mother. Definitively Excellent Merit will be his son and Endowed with Dharma his attendant.

source: གནས་པ་ཁྱད་པར་འཕགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Superior Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྨ་མེད་ཚུལ་འཆོས་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་བདུན་བདུན་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred seventy billion Unblemished worthy ones who are free from pretense.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be eighty-three thousand years,

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain for ninety-one thousand years.

source: དཔག་ཚད་བཅུ་པ་རྒྱལ་མཚན་བྱེ་བས་བརྒྱན། །
en: Ten leagues large and adorned with tens of millions banners.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་དབང་མཚུངས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་བའི་འོད་ཅེས་བྱ། །
en: “The thus-gone Janendrakalpa Will be born in a place called Victorious Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་སྦྱིན་སྲེག་འོད་འཕྲོ་ཡབ། །ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend sixty leagues. “Radiant Sacrifice will be his father, and Gathering of Qualities will be this victor’s mother.

source: སྲས་པོ་དགེ་ལྡན་དགེ་བཟངས་རིམ་གྲོ་པ། །
en: Endowed with Virtue will be his son and Excellent Virtue his attendant.

source: ཡོན་ཏན་སྣོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Holder of Qualities will be the scholar

source: ཡོན་ཏན་འོད་གསལ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གསུམ་ལ་ཡང་། །ཞི་བ་གཏི་མུག་མེད་ཅིང་ཆགས་མེད་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be sixty-three consecutive congregations, Each of them gathering one billion Serene one who are free from delusion and attachment.

source: རྣམ་གྲོལ་ཐོབ་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: “And when this attainer of liberation has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་ཐེར་འབུམ་དག་ནི་བདུན་ཅུ་འབྱུང་། །
en: The relics of this victor will be abundant, Residing in seventy billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་ས་ཡི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ལེགས་པར་གནས་ཞེས་བྱ། །
en: “The thus-gone Dharaṇīśvara Will be born in a place called Excellent Abiding.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་དོན་གནས་ཡིན། །བློ་གནས་བློ་གྲོས་རྒྱལ་ཡུམ་བྱང་ཆུབ་ནི། །སྲས་ཡིན་ལེགས་པའི་བྱང་ཆུབ་རིམ་གྲོ་པ། །
en: The family of this victor will be kṣatriya, And his light will extend ten million leagues. “Meaningful Abiding will be his father, and Enduring Mind of Intelligence will be this victor’s mother. Awakening will be his son and Excellent Awakening his attendant.

source: དོན་ཡོད་སྣ་ཚོགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Meaningful Diversity the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །སྟོན་ཅིང་སྒོམ་པའི་མཐར་ནི་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་རེ་རེ་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering seven hundred million Who have perfected teaching and meditation.

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain for twenty-one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོས་ཁམས་གསུམ་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And fine stūpas will fill the three realms.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མ་དགྱེས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་བསྡུས་ཞེས་བྱ། །
en: “The thus-gone Sūryapriya Will be born in a place called Gathering of Splendor.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཐོས་པའི་དབང་པོ་ཡབ། །དབང་པོའི་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Master of Learning will be his father, and Masterful Mode will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་གནས་པ་རིམ་གྲོ་པ། །
en: Leader will be his son and Abiding his attendant.

source: དམག་མའི་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Soldier will be the scholar

source: རྣམ་པར་ངེས་པར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Definitive Fame the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པ་ཀུན་གྱིས་གོས་པ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred twenty million Who are entirely unstained by existence.

source: བདེ་གཤེགས་སྒྲ་གཅན་ཟླ་བ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཏོག་རྣམས་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: “The well-gone Rāhucandra Will be born in a place called Illuminator of Crests.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གསུམ་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །སྣང་བ་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend seventy-three leagues. “Excellent Crest will be his father, and Endowed with Light will be this victor’s mother.

source: སྲས་པོ་གཟི་བརྗིད་ལྡན་སྣང་རིམ་གྲོ་པ། །
en: Splendor will be his son and Illuminating Endowment his attendant.

source: གྲགས་ལྡན་ཆེན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Great Possession of Fame will be the scholar

source: མྱ་ངན་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding Free from Suffering the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིགས་མེད་ཐང་ཆེན་ཕ་མཐར་ལེགས་གནས་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred thirty million Fearless ones who reside on the other side of the great plain.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will remain for sixty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་སྐྱེ་བའི། །ཡུལ་ནི་མེ་ཏོག་དག་གིས་བརྒྱན་ཞེས་བྱ། །
en: “The thus-gone Puṣpaprabha Will be born in a place called Adorned with Flowers.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡོན་ཏན་དབང་པོ་ཡབ། །ཡོན་ཏན་མཆོད་རྟེན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one thousand leagues. “Master of Qualities will be his father, and Stūpa Qualities will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་མཆོག་ཕན་འདོགས་རིམ་གྲོ་པ། །
en: Supreme Victor will be his son and Benefactor his attendant.

source: འཇིག་རྟེན་མཆོག་མ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Supreme in the World will be the scholar

source: མཐུ་རྩལ་རྒྱལ་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And King of Power the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཐར་པ་གཏི་མུག་མེད་པར་གནས་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering three hundred billion Liberated ones who are free from dullness.

source: ཆགས་པ་མེད་པར་གྱུར་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this teacher free from attachment Will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དགུ་པ་ནོར་བུ་བྱེ་བས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Nine leagues large and studded with millions of jewels.

source: དེ་བཞིན་གཤེགས་པ་སྨན་པའི་བདག་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་སེལ་ཅེས་བྱ། །
en: “The thus-gone Vaidyādhipa Will be born in a place called Suffering Dispelled.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །ཡོན་ཏན་ལྟ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend one thousand leagues. “Free from Suffering will be his father, and View of Qualities will be this victor’s mother.

source: སྲས་པོ་འཚོ་བྱེད་འཇིགས་མེད་རིམ་གྲོ་པ། །
en: Sustainer will be his son and Fearless his attendant.

source: བསོད་ནམས་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Merit Joy will be the scholar

source: སེང་གེའི་སྒྲ་སྒྲོགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Roaring like a Lion the one of miracles.
